<hr style="border-width:2px;border-color:#75DFC1">
<center><h1> Pandas for Data Science</h1></center>
<center><h2> Data Cleaning and Missing Values Management </h2></center>
<hr style="border-width:2px;border-color:#75DFC1">


## Introduction

 **Data cleaning** and **missing values management** (called **NaN** or **NA**) are two essential steps before any analysis on a database.

 The objective of this notebook is to detail each of these two steps in order to obtain a clean and easily usable `DataFrame`. Indeed, databases very often present this kind of problem.

 For this, we are going to use the `DataFrame` **`transactions`** imported in the previous exercise.


* **(a)** Import the `pandas` module under the name `pd` and load the file `"transactions.csv"` in a `DataFrame` named **`transactions`**. The values in the CSV file are separated by **commas** and the column containing the identifiers is **`'transaction_id'`**.


* **(b)** Display the first 10 rows of `transactions.csv` with the `head` method.

In [15]:
import pandas as pd
transactions = pd.read_csv("C:/Users/OlhaIshchenko/Documents/Daten_Analyse/unterricht/csv_Datei/transactions.csv", 
                           sep=",", index_col="transaction_id")
transactions.head(10)

,cust_id,tran_date,prod_subcat_code,prod_cat_code,Qty,Rate,Tax,total_amt,Store_type
transaction_id,,,,,,,,,
80712190438,270351,28-02-2014,1.0,1,-5,-772.0,405.300,-4265.300,e-Shop
29258453508,270384,27-02-2014,5.0,3,-5,-1497.0,785.925,-8270.925,e-Shop
51750724947,273420,24-02-2014,6.0,5,-2,-791.0,166.110,-1748.110,TeleShop
93274880719,271509,24-02-2014,11.0,6,-3,-1363.0,429.345,-4518.345,e-Shop
51750724947,273420,23-02-2014,6.0,5,-2,-791.0,166.110,-1748.110,TeleShop
97439039119,272357,23-02-2014,8.0,3,-2,-824.0,173.040,-1821.040,TeleShop
45649838090,273667,22-02-2014,11.0,6,-1,-1450.0,152.250,-1602.250,e-Shop
22643667930,271489,22-02-2014,12.0,6,-1,-1225.0,128.625,-1353.625,TeleShop
79792372943,275108,22-02-2014,3.0,1,-3,-908.0,286.020,-3010.020,MBR
50076728598,269014,21-02-2014,8.0,3,-4,-581.0,244.020,-2568.020,e-Shop


## 1. Cleaning up a dataset

> In this part we will introduce the methods of the `DataFrame` class that are essential to clean a dataset. These methods can be grouped into three different categories :
>
>> - **Duplicates management** (`duplicated` and `drop_duplicates` methods)
>>
>>
>> - **Modification of the elements** of a `DataFrame` (`replace`, `rename` and `astype` methods)
>>
>>
>> - **Operations** on the values of a `DataFrame` (`apply` method and `lambda` functions)
>
>

### Managing duplicates (`duplicated` and ` drop_duplicates` methods)

> **Duplicates** are identical entries that appear **more than once** in a dataset.
>
> When we first discover a dataset it is very important to **check up front** that there are no duplicates. The presence of duplicates will generate **errors** in the computation of statistics or the plotting of graphs.
>
> Let **`df`** be the following `DataFrame`:
>
>|          | Age  |Gender|  Height|
>|----------|------|------|--------|
>|**Robert**|  56  |   M  |   174  |
>|**Mark**  |  23  |   M  |   182  |
>|**Alina** |  32  |   F  |   169  |
>|**Mark**  |  23  |   M  |   182  |
>
> The presence of duplicates is checked using the **`duplicated`** method of a `DataFrame`:
>
> ``` py
> # We identify the rows containing duplicates
> df.duplicated()
>
> >>> 0 False
> >>> 1 False
> >>> 2 False
> >>> 3 True
> ```
>
> This method returns  `Series` object from `pandas`, which is equivalent to the column of a `DataFrame`. The `Series` object tells us for each row wether it is a duplicate.
>
> In this example, the result of the `duplicated` method informs us that **the row with index 3 is a duplicate**. Indeed, it is the **exact copy** of the row with index 1.
>
>
>
> Since the `duplicated` method returns an object of the `Series` class, we can apply the **`sum`** method to it in order to count the number of duplicates:
>
> ``` python
> # To calculate the sum of boolean values, we consider that True is worth 1 and False is worth 0.
> print(df.duplicated().sum())
> >>> 1
> ```
>
> The method of the `DataFrame` class used to remove duplicates is  **`drop_duplicates`**. Its header is as follows:
>
> ```py
> drop_duplicates(subset, keep, inplace)
> ```
>
>> - The `subset` parameter indicates the column(s) to consider in order to identify and remove duplicates. By default, **`subset = None`** namely we consider **all** the columns of the `DataFrame`.
>>
>>
>> - The `keep` parameter indicates which entry should be kept : 
>>>  *  **`'first'`** : We keep the **first** occurrence.
>>>
>>>
>>>  *  **`'last'`**: We keep the **last** occurrence.
>>>
>>>
>>>  *  **`False`**: We do not keep **any** occurrence.
>>>
>>>
>>>  *  By default, **`keep = 'first'`**.
>>
>>
>> - The **`inplace`** parameter (very common in the methods of the `DataFrame` class), specifies whether you modify **directly** the `DataFrame` (in this case `inplace = True`) or if the method returns a **copy** of the `DataFrame` (`inplace = False`). A method applied with the argument `inplace = True` is **irreversible**. By default, `inplace = False`.
>
>
> <div class="alert alert-danger">
<i class="fa fa-info-circle"></i>
    You have to be very careful when using the <code>inplace</code> parameter. A good practice is to forget this parameter and assign the <code>DataFrame</code> returned by the method to a <b>new</b> <code>DataFrame</code>.
> </div>
>
> The `keep` parameter is the one that is most often specified. Indeed, a database can have duplicates created on different dates. We will then specify the value of the `keep` argument to keep only the most recent entries, for example.
>
> Let us go back to the `df` `DataFrame` :
>
>|          | Age  |Gender|  Height|
>|----------|------|------|--------|
>|**Robert**|  56  |   M  |   174  |
>|**Mark**  |  23  |   M  |   182  |
>|**Alina** |  32  |   F  |   169  |
>|**Mark**  |  23  |   M  |   182  |
>
> We illustrate `df` with the following illustration :
>
> <br>
>
> <img src="https://assets-datascientest.s3-eu-west-1.amazonaws.com/train/duplicates_en.png" style = "width:400px">
>
> We illustrate in the following examples the entries that are **deleted** by the `drop_duplicates` method depending on the value of the `keep` parameter:
> 
> ``` py
> # We keep only the first occurrence of the duplicate
> df_first = df.drop_duplicates(keep = 'first')
> ```
>
> <br>
>
> <img src="https://assets-datascientest.s3-eu-west-1.amazonaws.com/train/duplicates_first_en.png" style = "width:400px">
>
> <br>
>
> ``` py
> # We keep only the last occurrence of the duplicate
> df_last = df.drop_duplicates(keep = 'last')
> ```
>
> <img src="https://assets-datascientest.s3-eu-west-1.amazonaws.com/train/duplicates_last_en.png" width="400">
>
> ``` py
> # We keep no duplicates
> df_false = df.drop_duplicates(keep = False)
> ```
> <img src="https://assets-datascientest.s3-eu-west-1.amazonaws.com/train/duplicates_false_en.png" width="400">
>

* **(c)** How many duplicates are there in the `transactions` `DataFrame` ?

In [4]:
transactions.duplicated().sum()

np.int64(112)

The transactions were recorded in anti-chronological order, i.e. the **first rows** contain the most **recent** transactions and the last rows the oldest transactions.

* **(d)** Eliminate duplicates from the database by keeping only the first occurrence, i.e. the most recent transaction.


* **(e)** Using the **`subset`** and **`keep`** parameters of the `drop_duplicates` method of `transactions`, display the **most recent** transaction for **each category of `prod_cat_code`**. To do this, you can remove all the duplicates from the `prod_cat_code` column by keeping only the first occurrence.

In [5]:
transactions = transactions.drop_duplicates(keep = 'first')


transactions.drop_duplicates(subset = ['prod_cat_code'], keep = 'first')

,cust_id,tran_date,prod_subcat_code,prod_cat_code,Qty,Rate,Tax,total_amt,Store_type
transaction_id,,,,,,,,,
80712190438,270351,28-02-2014,1.0,1,-5,-772.0,405.300,-4265.300,e-Shop
29258453508,270384,27-02-2014,5.0,3,-5,-1497.0,785.925,-8270.925,e-Shop
51750724947,273420,24-02-2014,6.0,5,-2,-791.0,166.110,-1748.110,TeleShop
93274880719,271509,24-02-2014,11.0,6,-3,-1363.0,429.345,-4518.345,e-Shop
43134751727,268487,20-02-2014,3.0,2,-1,-611.0,64.155,-675.155,e-Shop
25963520987,274829,20-02-2014,4.0,4,3,502.0,158.130,1664.130,Flagship store


### Modification of the elements of a `DataFrame` (` replace`, `rename` and `astype` methods)


> The **`replace`** method allows to **replace** one or more values ​​of a column of a` DataFrame`.
>
> Its header is as follows:
>
> ``` python
> replace(to_replace, value, ...)
> ```
>
>> - The `to_replace` parameter contains the value or the list of values **to be replaced**. It can be a list of integers, strings, booleans, etc.
>>
>>
>> - The `value` parameter contains the value or the list of the substitute **values**. It can also be a list of integers, strings, booleans, etc.
>
> <br>
>
> <img src="https://assets-datascientest.s3-eu-west-1.amazonaws.com/train/replace_en.png" height="400px">
>
> <br>
>
> In addition to modifying the elements of a `DataFrame`, it is possible to **rename** its columns.
>
> This is possible thanks to the **`rename`** method which takes as argument a **dictionary** whose **keys** are the **old** names and the **values** are the **new** names. You must also fill in the argument **`axis = 1`** to specify that the names to rename are those of the columns.
>
> ``` py
> # Creation of the dictionary associating the old names with the new column names
> dictionary = {'old_name1': 'new_name1',
>               'old_name2': 'new_name2'}
>
> # We rename the variables using the rename method
> df = df.rename(dictionary, axis = 1)
> ```
>
>
>
> It is sometimes necessary to modify not only the name of a column but also its **type**.
>
> For example, it is possible that when importing a database, a variable is of type string when in fact it is a numerical variable. Whenever one of the entries in the column is incorrectly recognized, `pandas` will consider that this column is of type string.
>
> This is possible thanks to the **`astype`** method.
>
> The types that we will see most often are:
>
>>  * `str`: Character string (`'Hello'`).
>>  * `float`: Floating point number (`1.0`, `1.14123`).
>>  * `Int`: Integer (`1`,`1231`)
>
>
> As for the **`rename`** method, **`astype`** can take as argument a dictionary whose **keys** are the **names of the columns whose type should be modified** and the **values** are the **new types** to assign. This is useful if you want to change the type of several columns at once.
>
>
> Most often, we will directly select the column whose type should be modified and overwrite it by applying the **`astype`** method to it.
>
> ``` python
> # Method 1: Creation of a dictionary then call to the astype method of the DataFrame
> dictionary = {'col_1': 'int',
>               'col_2': 'float'}
> df = df.astype(dictionary)
>
> # Method 2: Selection of the column and then calling the astype method of a Series
> df['col_1'] = df['col_1'].astype('int')
> ```
>
>
> <div class='alert alert-success'>
<i class='fa fa-exclamation-circle'></i>
    These methods also have the <code>inplace</code> parameter to perform the operation directly on the <code>DataFrame</code>. To be used with great caution.</div>


* If you make a mistake in the next exercise, you can re-import and redo the preprocessing by running the following cell.

In [11]:
# Data import
transactions = pd.read_csv("C:/Users/OlhaIshchenko/Documents/Daten_Analyse/unterricht/csv_Datei/transactions.csv", 
                           sep = ',', index_col = "transaction_id")

# Removal of duplicates
transactions = transactions.drop_duplicates(keep = 'first')


* **(f)** Import the `numpy` module under the name` np`.



* **(g)** Replace the modalities **`['e-Shop', 'TeleShop', 'MBR', 'Flagship store', np.nan]`** of the **`Store_type`** column by the modalities **`[1, 2, 3, 4, 0]`**.
The `np.nan` value is the one that encodes a missing value. We will replace this value with `0`.



* **(h)** Convert the type of the columns **`Store_type`** and **`prod_subcat_code`** to type **`'int'`**.



* **(i)** Rename the `'Store_type`',`'Qty'`, `'Rate'` and `'Tax'` columns with `'store_type'`,`'qty'`, `'rate'` and `'tax'`.

In [12]:
import numpy as np

# Replacement of values
transactions = transactions.replace(to_replace = ['e-Shop', 'TeleShop', 'MBR', 'Flagship store', np.nan],
                                    value = [1, 2, 3, 4, 0])

# Conversion of column types
new_types = {'Store_type'       : 'int',
             'prod_subcat_code' : 'int'}

transactions = transactions.astype(new_types)

# Renaming the columns
new_names = {'Store_type'   : 'store_type',
              'Qty'         : 'qty',
              'Rate'        : 'rate',
              'Tax'         : 'tax'}

transactions = transactions.rename(new_names, axis = 1)

# Display of the first rows of transactions
transactions.head()

C:\Users\AndreasWagner\AppData\Local\Temp\ipykernel_15836\1662725152.py:4: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  transactions = transactions.replace(to_replace = ['e-Shop', 'TeleShop', 'MBR', 'Flagship store', np.nan],

,cust_id,tran_date,prod_subcat_code,prod_cat_code,qty,rate,tax,total_amt,store_type
transaction_id,,,,,,,,,
80712190438,270351,28-02-2014,1,1,-5,-772.0,405.300,-4265.300,1
29258453508,270384,27-02-2014,5,3,-5,-1497.0,785.925,-8270.925,1
51750724947,273420,24-02-2014,6,5,-2,-791.0,166.110,-1748.110,2
93274880719,271509,24-02-2014,11,6,-3,-1363.0,429.345,-4518.345,1
51750724947,273420,23-02-2014,6,5,-2,-791.0,166.110,-1748.110,2


### Operations on the values ​​of a `DataFrame` (`apply` method and `lambda` functions)

> It is often interesting to modify or aggregate the information of the columns of a `DataFrame` using an operation or a function.
>
> These operations can be any type of function **which takes a column** as argument. Thus, the **numpy module is perfectly suited** to perform operations on this type of object.
>
> The method used to perform an operation on a column is the **`apply`** method of a `DataFrame` whose header is:
>
> ``` python
> apply(func, axis, ...)
> ```
>
> where:
>> * **`func`** is the function to apply to the column.
>> * **`axis`** is the dimension on which the operation must be applied.
>
> <span style="color:#09b038; text-decoration : underline"> Example: </span> `apply` and `np.sum`
>
> For each column with numerical values, we want to calculate the **sum of all rows**. The `sum` function of `numpy` does this, so we can use it with the `apply` method.
>
> Since we are going to perform an operation on the **rows**, we must therefore specify the argument **`axis = 0`** in the `apply` method.
>
> ``` py
> # Sum of the ROWS for each column of df
> df_lines = df.apply(np.sum, axis = 0)
> ```
> The result is the following:
>
> <br>
>
> <img src="https://assets-datascientest.s3-eu-west-1.amazonaws.com/train/apply_sum_lines_en.png" style = 'height:300px'>
>
> <br>
>
> Now, for each row we want to compute the **sum of all the columns**.
>
> We are going to perform this operation on the columns, we must therefore specify the argument **`axis = 1`** in the `apply` method.
>
> ``` py
> # Sum of columns for each ROW of df
> df_columns = df.apply(np.sum, axis = 1)
> ```
>
> The result is the following:
> <img src="https://assets-datascientest.s3-eu-west-1.amazonaws.com/train/apply_sum_columns_en.png" style ="height:280px">
>
> <br>
>
> These examples only illustrate the use of the `apply` method. To actually compute the sum of rows or columns, it is better to use the **`sum`** method of a `DataFrame` or a `Series`, which behaves in exactly the same way as the `sum` method of a numpy array.

The `tran_date` column of `transactions` contains the dates of the transactions in the format **`('day-month-year')`** (ex: `'28-02-2014'`). The dates are of type string: it is not possible to perform statistics on this variable for the moment.

We would rather have **3 different columns** for the day, month and year of each transaction. This would allow us, for example, to analyze and detect trends in transaction dates.


The date `'28-02-2014'` is a string. The day, month and year are separated by a hyphen **`'-'`**. The character string class has the **`split`** method to split a string on a specific character:

``` python
date = '28-02-2014 '

# Splitting the string on the '-' character
print(date.split('-'))
>>> ['28', '02', '2014']
```

This method returns a **list** containing the slices of the string on the specified character. Thus, to retrieve the day, all you have to do is select the **first** element of the split. To recover the month, we must take the second element and for the year the third.

* **(j)** Define a function **`get_day`** taking as argument a string and which returns the first element of its split by the character `'-'`.


* **(k)** Define the functions **`get_month`** and **`get_year`** which do the same with the second and third element of the split.


* **(l)** In 3 variables called **`days`**, **`months`** and **`years`**, store the result of the **`apply`** method on the **`tran_date`** column with the `get_day`, `get_month` and `get_year` functions. As these functions work element-wise, it is not necessary to specify the argument **`axis`** in the `apply` method.



* **(m)** Create the columns **`'day'`**, **`'month'`** and **`'year'`** in the `transactions` `DataFrame` and store the values of the `days`, `months` and `years`. Creating a new column is simply done by declaring it:
>
>``` python
># Create a new column 'day' with the values contained in days.
>transactions['day'] = days
>```


* **(n)** Display the first 5 rows of `transactions`.

In [13]:
def get_day(my_date):
    return my_date.split('-')[0]
def get_month(my_date):
    return my_date.split('-')[1]
def get_year(my_date):
    return my_date.split('-')[-1]
transactions['day'] = transactions['tran_date'].apply(get_day)
transactions['month'] = transactions['tran_date'].apply(get_month)
transactions['year'] = transactions['tran_date'].apply(get_year)
transactions[['day','month','year','tran_date']].head()

               day month  year   tran_date
transaction_id
80712190438     28    02  2014  28-02-2014
29258453508     27    02  2014  27-02-2014
51750724947     24    02  2014  24-02-2014
93274880719     24    02  2014  24-02-2014
51750724947     23    02  2014  23-02-2014


> The **`apply`** method is very powerful when combined with a **`lambda`** function.
>
> In Python, the keyword **`lambda`** is used to define an **anonymous** function: a function declared without name.
>
> A function **`lambda`** can take any number of arguments, but can only have one expression.
>
> Here is its syntax: 
>
> ```python 
> lambda arguments: expression
> ```
>
> `Lambda` functions allow you to define functions with a very short syntax : 
>
> 
>```python
># Example 1 
> x = lambda a: a + 2
>print(x(3))
> >>> 5
>```
>```python
># Example 2 
> x = lambda a, b : a * b
> print(x(2, 3))
> >>> 6
>```
>```python
># Example 3 
>x = lambda a, b, c : a - b + c
>print(x(1, 2, 3))
> >>> 2
>```
>Although syntactically different, **`lambda`** functions behave in the same way as regular functions that are declared using the **`def`** keyword.
>
> The classic definition of a function is done with the **`def`** keyword:
> ``` py
> def increment(x):
>     return x + 1
> ```
>
> It is also possible to define a function with the keyword **`lambda`**:
> ``` py
> increment = lambda x: x + 1
> ```
>
> The first method is very clean but the advantage of the second is that it can be defined on-the-fly directly **within** the **`apply`** method.
>
> Thus, the previous exercise can be done with a very compact syntax:
>
> ``` python
> transactions['day'] = transactions['tran_date'].apply(lambda date: date.split('-')[0])
> ```
>
> This kind of syntax is very practical and very often used for cleaning databases.
>
>
>The `prod_subcat_code` column of `transactions` depends on the `prod_cat_code` column because it identifies a **subcategory** of product. It would make more sense to have the category and subcategory of a product in the same variable.
>
>To do this, we will merge the values of these two columns:
>
>> * We will first convert the values of these two columns into strings using the **`astype`** method.
>>
>>
>>* Then, we will concatenate these strings to have a unique code representing both the category and sub-category. This can be done in the following way:
>>
>> ``` python
>> string1 = "I think"
>> string2 = "therefore I am."
>>
>> # Concatenation of the two strings by separating them with a space
>> print (string1 + " " + string2)
>> >>> I think therefore I am.
>> ```

To apply a lambda function to an entire row, you must specify the argument **`axis = 1`** in the `apply` method. In the function itself, the columns of the row can be accessed as on a `DataFrame`:

``` python
# Computation of the unit price of a product
transactions.apply(lambda row: row['total_ amt']/row['qty'], axis = 1)
```

* **(o)** Using a `lambda` function applied to `transactions`, create a column **`'prod_cat'`** in `transactions` containing the concatenation of the values of` prod_cat_code` and `prod_subcat_code` separated by a hyphen `'-'`. Remember to convert the values to strings.

>Displaying this column should yield:
>
>```
>transaction_id
>80712190438     1-1
>29258453508     3-5
>51750724947     5-6
>93274880719     6-11
>51750724947     5-6
>                ...
>94340757522     5-12
>89780862956     1-4
>85115299378     6-2
>72870271171     5-11
>77960931771     5-11
>```

In [14]:
transactions['prod_cat'] = transactions.astype('str').apply(lambda row: row['prod_cat_code']+'-'+row['prod_subcat_code'],
                                                            axis = 1)

print(transactions['prod_cat'])

transaction_id
80712190438     1-1
29258453508     3-5
51750724947     5-6
93274880719    6-11
51750724947     5-6
               ...
94340757522    5-12
89780862956     1-4
85115299378     6-2
72870271171    5-11
77960931771    5-11
Name: prod_cat, Length: 22941, dtype: object


# 2. Dealing with missing values
>
> A **missing value** is either:
>> * An unspecified value.
>> * A value that does not exist. In general, they result from mathematical calculations having no solution (a division by zero for example).
>
> A missing value appears under the name **NaN** ("**N**ot **a** **N**umber") in a `DataFrame`.
>
> In this part, we will see several methods to:
>
>> - **Detect** missing values (`isna` and `any` methods)
>> - **Replace** these values (`fillna` method)
>> - **Delete** missing values (`dropna` method)
>
> In one of the previous exercises, we used the `replace` method of `transactions` to replace missing values with `0`. This approach is not rigorous and should not be done in practice.
>
> For this reason, we are going to re-import the raw version of `transactions` to undo the steps we did in the previous exercises.

* **(a)** Run the cell below to re-import `transactions`, remove duplicates and rename its columns.

In [16]:
# Data import
transactions = pd.read_csv("C:/Users/OlhaIshchenko/Documents/Daten_Analyse/unterricht/csv_Datei/transactions.csv", 
                           sep = ',', index_col = "transaction_id")

# Duplicates removal
transactions = transactions.drop_duplicates(keep = 'first')

# Renaming the columns
new_names = {'Store_type'  : 'store_type',
              'Qty'        : 'qty',
              'Rate'       : 'rate',
              'Tax'        : 'tax'}

transactions = transactions.rename(new_names, axis = 1)

transactions.head()

,cust_id,tran_date,prod_subcat_code,prod_cat_code,qty,rate,tax,total_amt,store_type
transaction_id,,,,,,,,,
80712190438,270351,28-02-2014,1.0,1,-5,-772.0,405.300,-4265.300,e-Shop
29258453508,270384,27-02-2014,5.0,3,-5,-1497.0,785.925,-8270.925,e-Shop
51750724947,273420,24-02-2014,6.0,5,-2,-791.0,166.110,-1748.110,TeleShop
93274880719,271509,24-02-2014,11.0,6,-3,-1363.0,429.345,-4518.345,e-Shop
51750724947,273420,23-02-2014,6.0,5,-2,-791.0,166.110,-1748.110,TeleShop


### Detecting missing values  (`isna` and `any` methods)
>
> The **`isna`** method of a `DataFrame` detects its missing values. This method does not take any arguments.
>
> This method returns the same `DataFrame` whose values are:
>> * **`True`** if the original table cell is a missing value (`np.nan`)
>> * **`False`** otherwise.
>
> <br>
>
> <img src="https://assets-datascientest.s3-eu-west-1.amazonaws.com/train/is_null_en.png" width="750">
>
>
> <br>
>
> Since the `isna` method returns a `DataFrame`, we can use it with other methods of the `DataFrame` class to get more precise information:
>
>> - The **`any`** method - thanks to its `axis` argument - allows to determine **which columns** (`axis = 0`) or **which rows** (`axis = 1`) contain at least one missing value.
>>
>>
>> - The **`sum`** method counts the number of missing values per column or row (by specifying the `axis` argument). It is possible to use other statistical methods like `mean`,` max`, `argmax`, etc.
>
>
> Here are many examples of using the `any` and `sum` methods with `isna`:
>
> We use the `DataFrame` **`df`** from the previous illustrations:
>
> |    | Name    | Country   |   Age |
> |---:|:--------|:----------|------:|
> |  0 | NaN     | Australia |   NaN |
> |  1 | Duchamp | France    |    25 |
> |  2 | Hana    | Japan     |    54 |
>
> The `df.isna()` instruction returns:
>
>
> |    |   Name  |Country |   Age |
> |---:|--------:|-------:|------:|
> |  0 |   True  | False  | True  |
> |  1 |   False | False  | False |
> |  2 |   False | False  | False |
>
> ``` python
> # COLUMNS containing at least one missing value are detected
> df.isna().any(axis = 0)
> ```
> ```
> >>> Name     True
> >>> Country  False
> >>> Age      True
> ```
>
> ``` python
> # ROWS containing at least one missing value are detected
> df.isna().any (axis = 1)
> ```
>```
> >>> 0    True
> >>> 1    False
> >>> 2    False
> ````
>
> ``` python
> # Using conditional indexing to display entries
> # containing missing values
> df[df.isna().any(axis = 1)]
> ```
>
>
> which returns the `DataFrame`:
>
> |    |   Name| Country   |   Age |
> |---:|------:|:----------|------:|
> |  0 |   NaN | Australia |   NaN |
>
> ``` python
> # We count the number of missing values for each COLUMN
> df.isnull().sum(axis = 0)
> ```
> ```
> >>> Name     1
> >>> Country  0
> >>> Age      1
> ```
>
> ``` python
> # Count the number of missing values for each ROW
> df.isnull().sum(axis = 1)
> ```
> ```
> >>> 0   2
> >>> 1   0
> >>> 2   0
> ```
> The methods `isna`and `isnull`have exactly the same behavior.

* **(b)** How many columns of the `transactions` `DataFrame` contain missing values?



* **(c)** How many of `transactions`' entries contain missing values? You can use the `any` method along with the `sum` method.




* **(d)** Which column of `transactions` contains **the most** of missing values? You can use the `idxmax` method that returns the index of first occurrence of maximum over the requested axis.



* **(e)** Show `transaction` entries that contain at least one missing value in the `'rate'`, `'tax'` and `'total_amt'` columns. What do you notice?

In [17]:
# Which columns contain NaNs
columns_na = transactions.isna().any(axis = 0)

print(columns_na.sum(), "columns of transactions contain NaNs. \n")

# Which rows contain NaNs
rows_na = transactions.isna().any(axis = 1)

print(rows_na.sum(), "rows of transactions contain NaNs. \n")

# Number of NaNs per column
columns_nbna = transactions.isna().sum(axis = 0)

print ("The column containing the most NaNs is:",  columns_nbna.idxmax())

# Display the first 10 entries containing at least one NaN in 'rate', 'tax' or 'total_amt'
transactions.loc[transactions[['rate', 'tax', 'total_amt']].isna().any(axis = 1)].head(10)

# The three variables are still missing together.

5 columns of transactions contain NaNs.

107 rows of transactions contain NaNs.

The column containing the most NaNs is: store_type

,cust_id,tran_date,prod_subcat_code,prod_cat_code,qty,rate,tax,total_amt,store_type
transaction_id,,,,,,,,,
27576087298,270419,9-2-2014,11.0,6,-2,NaN,NaN,NaN,MBR
6472413088,272105,31-01-2014,11.0,6,2,NaN,NaN,NaN,e-Shop
13300797307,272662,12-1-2014,6.0,5,4,NaN,NaN,NaN,TeleShop
63096895453,270519,3-1-2014,3.0,1,1,NaN,NaN,NaN,Flagship store
77032870309,271120,28-11-2013,10.0,6,5,NaN,NaN,NaN,e-Shop
72504986680,270550,18-10-2013,3.0,2,3,NaN,NaN,NaN,Flagship store
47049265058,269588,24-08-2013,8.0,3,3,NaN,NaN,NaN,Flagship store
141709406,266910,7-8-2013,2.0,6,3,NaN,NaN,NaN,Flagship store
37780749229,272135,5-2-2013,4.0,1,2,NaN,NaN,NaN,e-Shop
82258282007,274767,31-01-2013,11.0,6,1,NaN,NaN,NaN,TeleShop


### Replacing missing values (`fillna` method)

> The `fillna` method allows you to replace the missing values of a `DataFrame` by **values you want**.
>
> ``` python
> # We replace all the NaNs of the DataFrame by zeros
> df.fillna(0)
>
> # We replace the NaNs of each numerical column by the average on this column
> df.fillna(df.mean()) # df.mean() can be replaced by any statistical method.
> ```
>
> It is common to replace missing values of a column containing **numerical** values with **statistics** like:
>> * The **mean**: `.mean`
>> * The **median**: `.median`
>> * The **minimum / maximum**: `.min` / `.max`.
>
> For categorical type columns, replace the missing values with:
>> * The **mode**, i.e. the most frequent modality: `.mode`.
>> * A **constant** or arbitrary category: `0`,` -1`.
>
> To avoid making replacement errors, it is very important to **select the correct columns** before using the `fillna` method.

If you make mistakes in the following exercise, you can re-import `transactions` using the following cell:

In [18]:
# Data import
transactions = pd.read_csv("C:/Users/OlhaIshchenko/Documents/Daten_Analyse/unterricht/csv_Datei/transactions.csv", 
                           sep = ',', index_col = "transaction_id")

# Removal of duplicates
transactions = transactions.drop_duplicates(keep = 'first')

# Renaming the columns
new_names = {'Store_type' : 'store_type',
              'Qty'       : 'qty',
              'Rate'      : 'rate',
              'Tax'       : 'tax'}

transactions = transactions.rename(new_names, axis = 1)


* **(f)** Replace the missing values in **`prod_subcat_code`**  column of `transactions` with `-1`.


* **(g)** Determine **the most frequent modality** (the mode) of the **`store_type`** column of `transactions`.


* **(h)** Replace the missing values of the `store_type` column by this modality. The value of this modality is accessed **at index 0** of the `Series` returned by `mode`.


* **(i)** Check that the `prod_subcat_code` and `store_type` columns of `transactions` no longer contain missing values.

In [19]:
# Replacing the NaNs of 'prod_subcat_code' by -1
transactions['prod_subcat_code'] = transactions['prod_subcat_code'].fillna(-1)

# Determining the mode of 'store_type'
store_type_mode = transactions['store_type'].mode()
print ("The most frequent mode of 'store_type' is:", store_type_mode[0])

# Replacing the NaNs of 'store_type' by its mode
transactions['store_type'] = transactions['store_type'].fillna(transactions['store_type'].mode()[0])

# Checking that these two columns no longer contain NANs
transactions[['prod_subcat_code', 'store_type']].isna().sum()

The most frequent mode of 'store_type' is: e-Shop

prod_subcat_code    0
store_type          0
dtype: int64


### Removing missing values (`dropna` method)
>
> The `dropna` method allows you to remove rows or columns containing missing values.
>
> The header of the method is as follows:
>
> ```py 
> dropna(axis, how, subset, ..)
> ```
>
>> - The **`axis`** parameter specifies whether to delete rows or columns (**`0`** for rows, **`1`** for columns).
>>
>>
>> - The **`how`** parameter lets you specify how the rows (or columns) are deleted:
>>>    * **`how = 'any'`**: We delete the row (or column) if it contains **at least one** missing value.
>>>    * **`how = 'all'`**: We delete the row (or column) if it contains **only** missing values.
>>
>>
>> - The **`subset`** parameter is used to specify the columns/rows on which the search for missing values is carried out.
>
>
> <span style="color:#09b038; text-decoration : underline"> Example: </span><br>
>
> ``` python
> # We delete all the rows containing at least one missing value
> df = df.dropna(axis = 0, how = 'any')
>
> # We delete the empty columns
> df = df.dropna(axis = 1, how = 'all')
>
> # We remove the rows with missing values in the 3 columns 'col2', 'col3' and 'col4'
> df.dropna(axis = 0, how = 'all', subset = ['col2', 'col3', 'col4'])
> ```
>
> As with the other methods of replacing values of a `DataFrame`, the `inplace` argument can be used with great care to perform the modification directly without reassignment.


Transaction data for which the transaction amount is not provided is of no interest to us. For this reason:

* **(j)** Delete the `transaction` entries for which the **`rate`**, **`tax`** and **`total_amt`** columns are **all** empty.


* **(k)** Check that the columns of `transactions` **no longer contain missing values**.

In [20]:
transactions = transactions.dropna(axis = 0, how = 'all', subset = ['rate', 'tax', 'total_amt'])

transactions.isna().sum(axis = 0)

cust_id             0
tran_date           0
prod_subcat_code    0
prod_cat_code       0
qty                 0
rate                0
tax                 0
total_amt           0
store_type          0
dtype: int64